import { ColorResolvable } from "discord.js";

export default class RandomApproachConstant {
    static readonly Title: string = "🌟 บางอย่างกำลังปรากฏขึ้นมา!!!";
    static readonly Color: ColorResolvable = "#ff9d00";
	static readonly Description: string[] = [
		"เงาแสงระยิบระยับส่องผ่านใบไม้! รีบไปดูก่อนจะหายไป",
		"มีอะไรเปล่งประกายอยู่ในพุ่มไผ่ รีบเก็บก่อนใครจะเจอ!",
		"แสงแปลกๆ ส่องออกมาจากโคนไม้ รีบไปดูเดี๋ยวนี้!",
		"กิ่งไม้สั่นแปลกๆ เหมือนมีของมีค่าซ่อนอยู่ รีบไปก่อนใคร",
		"ลำแสงประหลาดส่องผ่านหมอก เก็บไว้ก่อนจะหายไป!",
		"เสียงใสๆ ดังมาจากกองใบไม้ รีบไปดูก่อนจะเงียบ",
		"มีอะไรส่องแสงอยู่ข้างก้อนหิน รีบเก็บก่อนจะหมดแสง!",
		"ฝุ่นทองปลิวระบำอยู่ตรงนั้น รีบไปจับก่อนจะลอยหาย",
		"แสงระยิบระยับเปล่งออกจากโพรงไผ่ รีบเข้าไปดู!",
		"เสียงดังติ๊งๆ แปลกๆ เหมือนมีของมีค่าตกใส่ รีบไปเก็บ!",
		"แสงสีรุ้งแวววาวออกมาจากโพรงต้นไผ่ รีบไปดูก่อนใครจะมา!",
		"เสียงเหรียญกระทบกันดังใสๆ รีบวิ่งไปเก็บก่อนจะหาย",
		"หน้ากากทองคำส่องแสงระยิบระยับ รีบหยิบก่อนจะมีคนเห็น!",
		"โอ่งโบราณส่องแสงฟ้าวาววับ รีบเข้าไปดูก่อนจะปิดฝา",
		"กุญแจทองส่องประกายใต้แสงแดด รีบเก็บก่อนจะจมดิน!",
		"เต็นท์มหัศจรรย์ปรากฏขึ้นมา รีบเข้าไปก่อนจะหายไป",
		"สีทองไหลย้อยออกมาจากก้อนหิน รีบเก็บก่อนจะแห้ง!",
		"เป้าโบราณส่องแสงแดงๆ รีบไปก่อนจะหายไปในดิน",
		"ลูกเต๋าเพชรกลิ้งไปมา รีบจับก่อนจะกลิ้งหายไป!",
		"ดาวตกเล็กๆ ส่องแสงที่พื้น รีบเก็บก่อนจะดับแสง",
	];

	static getRandomDescription() {
		return RandomApproachConstant.Description[
			Math.floor(
				Math.random() * RandomApproachConstant.Description.length
			)
		];
	}
}
